<?php

//Задание 3
$cities = [
    "Минская область" => ["Борисов","Молодечно","Слуцк"],
    "Брестская область" => ["Барановичи","Пинск","Кобрин"],
    "Витебская область" => ["Полоцк","Орша","Поставы"],
    "Гомельская область" => ["Добруш","Мозырь","Рогачев"],
    "Гродненская область" => ["Слоним","Лида","Сморгонь"],
    "Могилевская область" => ["Бобруйск","Быхов","Кричев"]
];

echo "Задание 3 <br>";
foreach ($cities as $regions => $towns) {
    echo $regions.":<br>";
    foreach ($towns as $town) {
        echo $town."<br>";
    }
}